/**
 * TODO LIST
 * [ ] - 테스트 함수 만들고 실행하기
 * [ ] - 올바르지 않은 Argument일 때 -1을 반환하기
 *   [ ] - 배열은 홀수, 짝수 순의 데이터를 저장한다. ex) [23, 24]
 *   [ ] - 배열은 연속된 숫자의 데이터를 저장한다.
 *   [ ] - 배열은 1~400 범위의 숫자 데이터를 저장한다.
 *   [ ] - 배열은 시작면이나 마지막면의 숫자 데이터를 저장하지 않는다.
 * [ ] - 인자의 각 자리수를 1의 자리로 만들어, 배열로 반환하는 함수를 작성한다.
 * [ ] - 배열의 총합을 구하는 함수 만들기
 * [ ] - 배열의 총곱을 구하는 함수 만들기
 * [ ] - 포비의 큰 수를 구하는 함수 만들기
 * [ ] - 크롱의 큰 수를 구하는 함수 만들기
 * [ ] - 포비와 크롱의 큰 수들을 비교하여 결과를 반환하는 함수 만들기
 *   [ ] - 포비 승: 1
 *   [ ] - 크롱 승: 2
 *   [ ] - 무승부: 0
 */

/**
 * @param {Array} pobi 홀수와 짝수의 페이지를 갖고 있는 배열
 * @param {Array} crong 홀수와 짝수의 페이지를 갖고 있는 배열
 * @returns 게임의 결과를 반환한다.
 */
function problem1(pobi, crong) {
	var answer;
	return answer;
}

module.exports = problem1;

function Test() {
	console.log("Hello, Woowacourse!");
	problem1();
}

Test();
