// 기능 요구 사항

// - [] 동전을 담는 array를 하나 생성한다.
// - [] 50000원으로 나누고 몫을 배열의 첫번째 인덱스에 담아준다.
// - [] 10000원으로 나누고 몫을 배열의 두번째 인덱스에 담아준다.
// - [] 5000원으로 나누고 몫을 배열의 세번째 인덱스에 담아준다.
// - [] 1000원으로 나누고 몫을 배열의 네번째 인덱스에 담아준다.
// - [] 500원으로 나누고 몫을 배열의 5번째 인덱스에 담아준다.
// - [] 100원으로 나누고 몫을 배열의 6번째 인덱스에 담아준다.
// - [] 50원으로 나누고 몫을 배열의 7번째 인덱스에 담아준다.
// - [] 10원으로 나누고 몫을 배열의 8번째 인덱스에 담아준다.
// - [] money를 나눈후 나머지를 money에 넣어준다

function problem5(money) {
  var answer;
  return answer;
}

module.exports = problem5;
